{
  "bio": "## 20 Years Solving How Products Meet Consumers\n\nI'm an industrial designer who has spent two decades in the trenches of retail design—from sketching concepts on napkins to watching displays ship to 2,000+ stores. My work spans corrugated POP displays to trade show environments, automotive aftermarket to medical devices, sheet metal to acrylic to vacuum-formed plastics.\n\nCurrently Creative Director at Peachtree Packaging & Display in Lawrenceville, GA, where I lead design for corrugated retail displays and packaging. Working remotely allows me to also take on select freelance projects through partners like Crux Retail and Porchlight Studios—typically work involving materials, scales, or applications outside my day-to-day scope.\n\n## The Method: Rocks in a Tumbler\n\nMy design process draws from an analogy Steve Jobs used to love: when you put rough rocks in a tumbler with water and grit, they bang against each other. The collisions knock off the rough edges. What emerges are smooth, beautiful stones.\n\nGreat design works the same way. For every project, I generate 15-30 rapid concept sketches—not to show off volume, but because the right solution rarely appears in the first three ideas. These concepts collide with each other, with client constraints, with manufacturing realities, with retail requirements. The friction reveals what works.\n\nThis rocks in a tumbler methodology has served clients from Coca-Cola to Home Depot, automotive accessories to ski technology, medical equipment to premium spirits.\n\n## AI as Creative Partner\n\nOver the past year, I've been building AI-powered tools that extend the tumbler methodology. These aren't traditional AI design generators—they're structured debate systems that simulate expert panels, challenging assumptions and stress-testing ideas before I commit to sketching.\n\nThis approach has led to AskBetter, a platform I'm developing that transforms simple questions into sophisticated multi-perspective analysis. The goal isn't to replace human judgment, but to surface blindspots faster.\n\n## Why This Portfolio Exists\n\nMost designers show finished work in service of landing new clients. That's fine, but it misses something important: understanding how someone thinks.\n\nThis portfolio demonstrates both outcomes (the projects) and process (the methodology). If you're hiring for a one-off design execution, there are cheaper options. If you're looking for someone who can navigate ambiguous requirements, synthesize constraints, and deliver production-ready solutions that actually work in the field—let's talk.\n\n## Background\n\n20 years of industrial design focused on retail and trade show environments. BFA in Industrial Design. Experience ranges from corrugated displays to sheet metal fabrication, vacuum-formed plastics to CNC work. Recent clients include Carv ski technology, KORR medical equipment, Dometic, Trex, and various automotive aftermarket brands.\n\nBased in Georgia. Work remotely. Available for select projects."
}
